In [1]:
import pandas as pd

In [3]:
summer = pd.read_csv("data/summer.csv")

In [4]:
summer.head()

,Year,City,Sport,Discipline,Athlete,Country,Gender,Event,Medal
0,1896,Athens,Aquatics,Swimming,"HAJOS, Alfred",HUN,Men,100M Freestyle,Gold
1,1896,Athens,Aquatics,Swimming,"HERSCHMANN, Otto",AUT,Men,100M Freestyle,Silver
2,1896,Athens,Aquatics,Swimming,"DRIVAS, Dimitrios",GRE,Men,100M Freestyle For Sailors,Bronze
3,1896,Athens,Aquatics,Swimming,"MALOKINIS, Ioannis",GRE,Men,100M Freestyle For Sailors,Gold
4,1896,Athens,Aquatics,Swimming,"CHASAPIS, Spiridon",GRE,Men,100M Freestyle For Sailors,Silver

In [5]:
summer.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 31165 entries, 0 to 31164
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Year        31165 non-null  int64
 1   City        31165 non-null  object
 2   Sport       31165 non-null  object
 3   Discipline  31165 non-null  object
 4   Athlete     31165 non-null  object
 5   Country     31161 non-null  object
 6   Gender      31165 non-null  object
 7   Event       31165 non-null  object
 8   Medal       31165 non-null  object
dtypes: int64(1), object(8)
memory usage: 2.1+ MB

In [6]:
athlete = summer["Athlete"]

In [7]:
athlete.head()

0         HAJOS, Alfred
1      HERSCHMANN, Otto
2     DRIVAS, Dimitrios
3    MALOKINIS, Ioannis
4    CHASAPIS, Spiridon
Name: Athlete, dtype: object

In [8]:
athlete.tail(n=5)

31160           JANIKOWSKI, Damian
31161    REZAEI, Ghasem Gholamreza
31162               TOTROV, Rustam
31163            ALEKSANYAN, Artur
31164               LIDBERG, Jimmy
Name: Athlete, dtype: object

In [9]:
type(athlete)

pandas.core.series.Series

In [10]:
athlete.dtype

dtype('O')

In [11]:
athlete.shape

(31165,)

In [12]:
athlete.describe()

count               31165
unique              22762
top       PHELPS, Michael
freq                   22
Name: Athlete, dtype: object

In [13]:
athlete.size

31165

In [14]:
athlete.count()

31165

In [15]:
athlete.min()

'AABYE, Edgar'

In [16]:
athlete.unique()

array(['HAJOS, Alfred', 'HERSCHMANN, Otto', 'DRIVAS, Dimitrios', ...,
       'TOTROV, Rustam', 'ALEKSANYAN, Artur', 'LIDBERG, Jimmy'],
      dtype=object)

In [17]:
athlete.nunique()

22762

In [18]:
athlete.value_counts()

PHELPS, Michael                             22
LATYNINA, Larisa                            18
ANDRIANOV, Nikolay                          15
MANGIAROTTI, Edoardo                        13
ONO, Takashi                                13
                                            ..
LI, Jie                                      1
VON HEYDEN, Herman Carel Felix Clothilde     1
SCOTT, John Malcolm                          1
HONEYCUTT, Francis Webster                   1
HOWALDT, Hans                                1
Name: Athlete, Length: 22762, dtype: int64

In [19]:
athlete.value_counts(sort=True, ascending=True)

HOWALDT, Hans                                1
HONEYCUTT, Francis Webster                   1
SCOTT, John Malcolm                          1
VON HEYDEN, Herman Carel Felix Clothilde     1
LI, Jie                                      1
                                            ..
ONO, Takashi                                13
MANGIAROTTI, Edoardo                        13
ANDRIANOV, Nikolay                          15
LATYNINA, Larisa                            18
PHELPS, Michael                             22
Name: Athlete, Length: 22762, dtype: int64

In [21]:
athlete.value_counts(sort=True, ascending=False, normalize=True).head()

PHELPS, Michael         0.000706
LATYNINA, Larisa        0.000578
ANDRIANOV, Nikolay      0.000481
MANGIAROTTI, Edoardo    0.000417
ONO, Takashi            0.000417
Name: Athlete, dtype: float64

## Copy Method - Do this because modifying a reference from a DataFrame edits the underlying

In [28]:
titanic = pd.read_csv("data/titanic.csv")

In [30]:
age = titanic.age.copy()

In [31]:
age.head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: age, dtype: float64

In [32]:
age.iloc[2] = 29

In [33]:
age.head()

0    22.0
1    38.0
2    29.0
3    35.0
4    35.0
Name: age, dtype: float64

In [34]:
titanic.head()

   survived  pclass     sex   age  sibsp  parch     fare embarked deck
0         0       3    male  22.0      1      0   7.2500        S  NaN
1         1       1  female  38.0      1      0  71.2833        C    C
2         1       3  female  26.0      0      0   7.9250        S  NaN
3         1       1  female  35.0      1      0  53.1000        S    C
4         0       3    male  35.0      0      0   8.0500        S  NaN

### Sorting

In [37]:
dic = {1:10, 3:25, 2:6, 4:36, 5:2, 6:0, 7:None}
dic

{1: 10, 3: 25, 2: 6, 4: 36, 5: 2, 6: 0, 7: None}

In [40]:
sales = pd.Series(dic)
sales

1    10.0
3    25.0
2     6.0
4    36.0
5     2.0
6     0.0
7     NaN
dtype: float64

In [41]:
sales.sort_index()

1    10.0
2     6.0
3    25.0
4    36.0
5     2.0
6     0.0
7     NaN
dtype: float64

In [42]:
sales.sort_index(ascending=True)

1    10.0
2     6.0
3    25.0
4    36.0
5     2.0
6     0.0
7     NaN
dtype: float64

In [44]:
sales.sort_values(ascending=False)

4    36.0
3    25.0
1    10.0
2     6.0
5     2.0
6     0.0
7     NaN
dtype: float64

In [47]:
sales.sort_values(inplace=True)

In [48]:
sales

6     0.0
5     2.0
2     6.0
1    10.0
3    25.0
4    36.0
7     NaN
dtype: float64

In [50]:
sales.sort_values(na_position="last", inplace=True)

In [54]:
dic = {"Mon":10, "Wed":25, "Tues":6, "Thur":36, "Fri":2, "Sat":0, "Sun":None}

In [55]:
sales = pd.Series(dic)

In [56]:
sales

Mon     10.0
Wed     25.0
Tues     6.0
Thur    36.0
Fri      2.0
Sat      0.0
Sun      NaN
dtype: float64

In [57]:
sales.sort_values()

Sat      0.0
Fri      2.0
Tues     6.0
Mon     10.0
Wed     25.0
Thur    36.0
Sun      NaN
dtype: float64